# PointLightShape Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointLightShape Constructor
PointLightShape Class See Also
---
Creates a point light shape object.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PointLightShape()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
PointLightShape()
```

# See Also
PointLightShape Class
PointLightShape Overload
Autodesk.Revit.DB.Lighting Namespace